src/Catalogs/кфк_т_ТестовыйСправочник/кфк_т_ТестовыйСправочник.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>кфк_т_ТестовыйСправочник</name>
  <attributes>
    <name>ДатаИВремя</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Число</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>30</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Булево</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Перечисление</name>
    <type>
      <types>EnumRef.кфк_т_ТестовоеПеречисление</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>ДатаИВремя</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Строка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/кфк_т_ТестовыйСправочник/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура СгенерироватьТестовыеДанные(Количество) Экспорт
	
	ГСЗ = Обработки.кфк_т_ГенераторСлучайныхЗначений.Создать();
	
	НачатьТранзакцию();
	
	Для Номер = 1 По Количество Цикл
		
		Объект = СоздатьЭлемент();
		Объект.Наименование = ГСЗ.СлучайнаяСтрока(100);
		Объект.ДатаИВремя = ТекущаяДатаСеанса();
		Объект.Число = ГСЗ.СлучайноеЧисло(, , 4);
		Объект.Булево = ГСЗ.СлучайноеБулево();
		Объект.Перечисление = ГСЗ.СлучайноеЗначениеПеречисления(Перечисления.кфк_т_ТестовоеПеречисление);
		Объект.Комментарий = ГСЗ.СлучайнаяСтрока(256);
		
		Для НомерТЧ = 1 По ГСЗ.СлучайноеЧисло(0, 10) Цикл
			
			НоваяСтрока = Объект.ТабличнаяЧасть.Добавить();
			НоваяСтрока.ДатаИВремя = ГСЗ.СлучайнаяДата();
			НоваяСтрока.Строка = ГСЗ.СлучайнаяСтрока(256);
			
		КонецЦикла;
		
		Объект.ОбменДанными.Загрузка = Истина;
		Объект.ДополнительныеСвойства.Вставить("кфкПропуститьРегистрацию", Истина);
		Объект.Записать();
	
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

// Экспортируемая серверная функция, формирующая тело сообщения для отправки в Kafka.
// 
//  !!! ВНИМАНИЕ !!!
//  Если при регистрации регистра набор записей пуст, то:
//     * флаг ЭтоУдаление будет установлен в значение ДА;
//     * параметр Объект будет содержать значения полей, указанных в отборе.
// 
// Параметры:
//   Объект - СправочникОбъект.кфк_т_ТестовыйСправочник, СправочникСсылка.кфк_т_ТестовыйСправочник - Объект ссылочного типа. Передаётся, если регистрация по записи объекта или объект был передан в кфкИнтеграция.ПоместитьВОчередьИсходящих.
//   Свойства - Структура - Дополнительные свойства сообщения:
//     * Продюсер - СправочникСсылка.кфкПродюсеры - Продюсер сообщения;
//     * ТипОбъект - Строка - Тип объекта, к которому относится сообщение;
//     * ТипИсходныхДанных - Строка - Тип исходных данных, к которому относится сообщение;
//     * СобытиеРегистрации - ПеречислениеСсылка.кфкСобытияРегистрации - Событие регистрации к обмену, см. кфкИнтеграция.ЭтоРегистрацияПриЗаписи, ЭтоРегистрацияПринудительно, ЭтоРегистрацияПрограммно;
//     * КлючРегистрации - Строка - Уникальный ключ регистрации;
//     * ДатаРегистрации - Дата - Дата регистрации события;
//     * ДатаРегистрацииМС - Число - Дата регистрации в миллисекундах;
//     * ПоследняяОбработка - Дата - Дата последней обработки сообщения;
//     * ЭтоУдаление - Булево - Флаг, указывающий, что регистрация была вызвана событием удаления;
//     * СсылкаНаОбъект - Неопределено, ЛюбаяСсылка - Ссылка на объект, к которому относится регистрация.
//   ТекстЖурнала - Строка - Текст журнала
//   Отказ - Булево - Признак отмены формирования и отправки сообщения.
// 
// Возвращаемое значение:
//   Неопределено, Структура - Описание сообщения, кфкИнтеграция.ПараметрыСообщения():
//     * Данные - Строка, ДвоичныеДанные, Структура - Тело сообщения
//     * Ключ - Строка - Уникальный идентификатор сообщения
//     * Заголовки - Соответствие Из Строка - Заголовки сообщения
//@skip-check doc-comment-type
//@skip-check doc-comment-ref-link
Функция Сериализация(Объект, Свойства, ТекстЖурнала, Отказ) Экспорт

	Результат = МодульКФК().ПараметрыСообщения();
	
	Данные = Новый Структура;
	Данные.Вставить("ref", Объект.Ссылка);
	Данные.Вставить("isDeleted", Объект.ПометкаУдаления);
	Данные.Вставить("name", Объект.Наименование);
	Данные.Вставить("dateTime", Объект.ДатаИВремя);
	Данные.Вставить("number", Объект.Число);
	Данные.Вставить("boolean", Объект.Булево);
	Данные.Вставить("enum", Объект.Перечисление);
	Данные.Вставить("comment", Объект.Комментарий);
	
	ТабличнаяЧасть = Новый Массив;
	Для Каждого СтрокаТабличнойЧасти Из Объект.ТабличнаяЧасть Цикл
		ДанныеСтроки = Новый Структура;
		ДанныеСтроки.Вставить("dateTime", СтрокаТабличнойЧасти.ДатаИВремя);
		ДанныеСтроки.Вставить("string", СтрокаТабличнойЧасти.Строка);
		ТабличнаяЧасть.Добавить(ДанныеСтроки);
	КонецЦикла;
	Данные.Вставить("table", ТабличнаяЧасть);
	
	Результат.Данные = Данные;
	Результат.Заголовки.Вставить("ДатаСериализация", ТекущаяУниверсальнаяДата());
	
	Возврат Результат;

КонецФункции

// Экспортируемая серверная процедура, выполняющая обработку тела сообщения из Kafka.
// 
// Параметры:
//   ТелоСообщения - Строка, ДвоичныеДанные - Тело сообщения, передаваемое из брокера Kafka. Тип зависит от формата исходного сообщения.
//   Свойства - Структура - Дополнительные свойства сообщения:
//       * Консьюмер - СправочникСсылка.кфкКонсьюмеры - источник (консьюмер), получивший сообщение;
//       * Топик - Строка - Наименование топика
//       * Ключ - Строка - Ключ (идентификатор) сообщения, используемый для партиционирования;
//       * Раздел - Строка - Номер или имя раздела (partition);
//       * Смещение - Строка - Смещение (offset) сообщения в разделе;
//       * Заголовки - Соответствие Из Строка - Заголовки сообщения
//       * ДатаЗагрузки - Дата - Дата получения сообщения системой;
//       * ДатаОбработки - Дата - дата последней обработки сообщения.
//   ТекстЖурнала - Строка - Текст журнала.
//   Отказ - Булево - Признак отмены обработки сообщения.
//@skip-check doc-comment-type
Процедура Десериализация(ТелоСообщения, Свойства, ТекстЖурнала, Отказ) Экспорт
	
	Данные = ОбщегоНазначения.JSONВЗначение(ТелоСообщения, "dateTime", Ложь);
	
	СсылкаНаОбъект = ПолучитьСсылку(Новый УникальныйИдентификатор(Данные.ref));
	Объект = СсылкаНаОбъект.ПолучитьОбъект();
	Если Объект = Неопределено Тогда
		Объект = СоздатьЭлемент();
		Объект.УстановитьСсылкуНового(СсылкаНаОбъект);
	КонецЕсли;
	
	Объект.ПометкаУдаления = Данные.isDeleted;
	Объект.Наименование = Данные.name;
	Объект.ДатаИВремя = Данные.dateTime;
	Объект.Число = Данные.number;
	Объект.Булево = Данные.boolean;
	Объект.Перечисление = Перечисления.кфк_т_ТестовоеПеречисление[Данные.enum];
	Объект.Комментарий = Данные.comment;
	
	Объект.ТабличнаяЧасть.Очистить();
	Для Каждого СтрокаТЧ Из Данные.table Цикл
		НоваяСтрока = Объект.ТабличнаяЧасть.Добавить();
		НоваяСтрока.ДатаИВремя = СтрокаТЧ.dateTime;
		НоваяСтрока.Строка = СтрокаТЧ.string;
	КонецЦикла;
	
	МодульКФК().Отключить(Объект);
	
	Объект.ОбменДанными.Загрузка = Истина;
	Объект.Записать();
	
КонецПроцедуры

// Экспортируемая серверная функция, выполняющая выборку данных по заданным условиям запроса API.
// 
// Параметры:
//   ПараметрыЗапроса - Соответствие Из Произвольный - Кастомные параметры запроса.
//   Свойства - Структура - Дополнительные свойства:
//     * ИмяТопика - Строка - Имя топика;
//     * ТипОбъект - Строка - Тип объекта;
//   ТекстЖурнала - Строка - Текст ответа на запрос;
//   Отказ - Булево - Признак отмены запроса.
// 
// Возвращаемое значение:
//   Массив Из ЛюбаяСсылка, СправочникОбъект, ДокументОбъект, РегистрСведенийНаборЗаписей - Массив данных, подлежащих выгрузке через Kafka.
Функция ПодборДанных(ПараметрыЗапроса, Свойства, ТекстЖурнала, Отказ) Экспорт

	Результат = Новый Массив;
	
	Если ПараметрыЗапроса.Получить("all") = Истина Тогда
		
		Запрос = Новый Запрос("ВЫБРАТЬ Справочник.кфк_т_ТестовыйСправочник.Ссылка");
		Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
		
	ИначеЕсли ПараметрыЗапроса.Получить("ref") <> Неопределено Тогда
		СсылкаНаОбъект = ПолучитьСсылку(Новый УникальныйИдентификатор(ПараметрыЗапроса.ref));
		Если ОбщегоНазначения.СсылкаСуществует(СсылкаНаОбъект) Тогда
			Результат.Добавить(СсылкаНаОбъект);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция МодульКФК()
	
	//@skip-check bsl-legacy-check-string-literal
	Возврат ОбщегоНазначения.ОбщийМодуль("кфкИнтеграция");
	
КонецФункции

#КонецОбласти

#КонецЕсли
